{
  "session_id": "8041e2af-e661-4e22-a6ab-bb29cfbb1f21",
  "created_at": "2025-06-13T12:34:13.619450",
  "profile_url": "https://www.linkedin.com/in/karthikbalaji99/",
  "job_description": "About the job\nAryaXAI is looking for a passionate and capable engineer to lead the development of our Enterprise AI Agent and AI Data Science Agent workstreams. Our mission is to build agentic systems that bring explainability, safety, and scalability to the forefront of enterprise AI.\n\nAs an AI Agent Engineer at AryaXAI, you'll play a key role in shaping intelligent agents that assist in enterprise decision-making, automate complex data science workflows, and integrate seamlessly into business ecosystems. These agents will serve as collaborators for enterprise teams—leveraging reasoning, tool use, and memory—while staying aligned with our focus on transparent and trustworthy AI.\n\nWe're seeking a strong engineering generalist with deep experience in LLMs, agent frameworks, and production-scale systems. You’ve likely prototyped or shipped agent-based systems, pushed the boundaries of what LLMs can do, and are looking for a meaningful opportunity to build the future of responsible AI.\n\nResponsibilities\n\nLead the design and development of Enterprise AI Agents and Data Science Agent systems that combine reasoning, tool orchestration, and memory.\nCollaborate with product, research, and infrastructure teams to create scalable agent architectures tailored for enterprise users.\nBuild agent capabilities for tasks like automated analysis, reporting, data wrangling, and domain-specific workflows across business verticals.\nIntegrate real-time knowledge, enterprise APIs, RAG pipelines, and proprietary tools into agentic workflows.\nWork closely with the alignment and explainability teams to ensure agents remain safe, auditable, and transparent in their reasoning and output.\nContinuously evaluate and incorporate advances in GenAI (e.g., controllability, multi-modal models, memory layers) into the agent stack.\nHelp shape the engineering culture at AryaXAI through mentorship, reviews, and innovation.\n\nRequirements\n\nDemonstrated experience building with LLMs and Agentic frameworks (e.g., LangChain, LangFlow, Semantic Kernel, Haystack, ReAct, AutoGPT, etc.).\nExperience with productionizing AI/LLM workflows and integrating them into real-world applications or systems.\n2+ years of software engineering experience, ideally with some time in early-stage startups or AI-first environments.\nStrong Python skills and solid understanding of full-stack backend architecture (APIs, cloud infra, databases).\nA passion for building ethical, explainable, and high-impact AI products that solve real enterprise problems.\n(Bonus) Experience working on agent toolchains for data science, ML ops, or enterprise analytics.",
  "profile_data": {},
  "keywords": "",
  "messages": []
}