{
  "session_id": "d5701d01-d152-4ef3-a740-5450265e542c",
  "created_at": "2025-06-16T11:33:46.455016",
  "profile_url": "https://linkedin.com/in/abdulbasithr",
  "job_description": "Adform focuses on an exploration of a vast amount of online advertising data, development of predictive and segmentation models to optimize campaign strategy towards the most meaningful inventory, audience and ad, fraud detection, and many others. You will be a vital part of the data scientist efforts, working in a cross-functional international Agile team, with other data scientists, engineers, product managers, and leaders located in multiple locations around the world. If you are hands-on passionate, crazy about a development of advanced algorithms, machine learning, statistics, Hadoop, Python and SQL, have an ownership mindset, love to work in teams with smart, informal and open people, we’d love to get to know you! \n\nOur focus is Big Data, High Load and challenging experiences with understanding and taking advantage from data in Ad-Tech industry.\n \n\n\nWe hope you are ready to change the game! Be ready to:\n\nApply advanced machine learning/statistical algorithms scalable to huge data sets to: \nDetermine the most meaningful ad, served to the right user at the optimal time, and the best price \nIdentify behaviours, interests and segments of web users across billions of transactions to find the most optimal audience for a given advertising activity \nEliminate suspicious / non-human traffic \nMaintenance our products, support customers in analysing the reasons behind the decisions made by our algorithms and look for new improvements in the process of striving for their excellence \nWork closely with other Data Scientists, development, and product teams to implement algorithms into production-level software. Mentor less experienced colleagues. \nContribute to identify opportunities for leveraging company data to drive business solutions \nBe an active technical challenger in the team for the purpose of mutual improvement and broadening of team and company horizons \nDesign solutions and lead cross-functional technical projects from ideation to deployment \n\n\nAttitude First. Everything else will follow. We can grow together faster if you have:\n\nMinimum 1 year work experience in a similar senior position. Minimum 6 years experience in Data Science in total. \nMasters or PhD in a quantitative field such as Machine Learning, Computer Science, Applied Mathematics, Statistics or related. \nExcellent mathematical and statistical skills (statistical inference), experience in working with large datasets. Knowledge of data pipelines, ETL processes. \nVery good knowledge of multiply supervised and unsupervised machine learning techniques with math background and hands-on experience \nGreat problem-solving and analytical skills. \nAbility to structure a large business problem into tractable and reasonable components, design and deploy scalable machine learning solutions \nProficiency in Python, SQL \nExperience with big data tools (e.g. Spark, Hadoop)\nAdform‘s guiding principles ingrained in your profile: Focus on Client Value, Behave with Decency, Take Ownership, Care, Collaborateas a TeamPlayer, Remain Ambitious, and StandTall inall interactions \n\n\nStand out by having:\n\nKnowledge of Ad Tech industry solutions \nKnowledge of web technologies \n\n\nOur promise to you:\n\nYou will be a vital part of the data scientist efforts, working in a cross-functional international Agile team, with other data scientists, engineers, product managers, and leaders located in multiple locations around the world. \nA dynamic, inspiring, and international environment filled with ambitious and caring colleagues\nPremium health insurance with ₹10,00,000 coverage for you and your family\n24 paid vacation days to enjoy life outside of work\nPaid maternity (6 months) and paternity (2 weeks)\nAnnual learning budget to help you grow your skills and support continuous learning\nRewarding referral program for helping us grow\nGlobal perks such as birthday gifts, work anniversaries, and company events to connect with colleagues and have fun\nAnd much more – join us to explore the full experience\n\n\nDiversity s Inclusion @Adform:\n\nAdform is an equal opportunity employer with a global perspective. We remain committed to creating an environment that not only respects different backgrounds but celebrates them too. We believe that diversity in all its forms enhances our teams’ creativity, innovation, and effectiveness, and therefore we value different backgrounds, perspectives, and skills.\nWe are committed to creating a work environment where Adform employees feel valued for who they are and what they can contribute, free from any type of discrimination.",
  "profile_data": {},
  "keywords": "",
  "messages": []
}